# vim:ft=ruby
if OS.mac?
    # taps
    tap "homebrew/cask-fonts"

    # Applications
    cask "docker"
    cask "imageoptim" # a tool to optimize images
    brew "musikcube" # terminal music player
    cask "wezterm" # a better terminal emulator

    # Fonts
    cask "font-hack"
    cask "font-jetbrains-mono"
    cask "font-ubuntu"
elsif OS.linux?
    brew "xclip" # access to clipboard (similar to pbcopy/pbpaste)
    brew "docker"
end
# packages
brew "bat" # better cat (syntax highlighting)
brew "docker-completion"
brew "gh" # GitHub CLI
brew "git" # Git version control (latest version)
brew "glow" # markdown viewer
brew "gnupg" # GPG
brew "grep" # grep (latest)
brew "lazygit" # a better git UI
brew "neovim" # A better vim
brew "pass" # Local CLI password manager.
brew "python" # python (latest)
brew "shellcheck" # diagnostics for shell sripts
brew "tree" # pretty-print directory contents
# brew "vim" # Vim (latest)
brew "wdiff" # word differences in text files
brew "wget" # internet file retriever
brew "zsh" # zsh (latest)
